// src/constants/regions.ts

// 都道府県と市（東京都は特別区）を管理する型
export interface Prefecture {
  readonly name: string;
  readonly cities: readonly string[];
}

// 地域と都道府県のデータを定義するための型
export interface Region {
  readonly name: string;
  readonly prefectures: readonly Prefecture[];
}

// イベント一覧の地域フィルターで利用する地域・都道府県・市（東京都は特別区）のデータ
export const REGIONS: readonly Region[] = [
  // 北海道
  {
    name: "北海道",
    prefectures: [
      {
        name: "北海道",
        cities: [
          "札幌市",
          "函館市",
          "旭川市",
          "小樽市",
          "帯広市",
          "釧路市",
          "北見市",
          "苫小牧市",
          "江別市",
          "千歳市",
        ],
      },
    ],
  },

  // 東北地方
  {
    name: "東北",
    prefectures: [
      {
        name: "青森県",
        cities: ["青森市", "弘前市", "八戸市", "十和田市", "むつ市"],
      },
      {
        name: "岩手県",
        cities: [
          "盛岡市",
          "宮古市",
          "大船渡市",
          "花巻市",
          "北上市",
          "一関市",
          "奥州市",
        ],
      },
      {
        name: "宮城県",
        cities: ["仙台市", "石巻市", "塩竈市", "名取市", "多賀城市"],
      },
      {
        name: "秋田県",
        cities: ["秋田市", "能代市", "横手市", "大館市", "大仙市"],
      },
      {
        name: "山形県",
        cities: ["山形市", "米沢市", "鶴岡市", "酒田市", "天童市"],
      },
      {
        name: "福島県",
        cities: ["福島市", "会津若松市", "郡山市", "いわき市", "白河市"],
      },
    ],
  },

  // 関東地方
  {
    name: "関東",
    prefectures: [
      {
        name: "茨城県",
        cities: ["水戸市", "日立市", "土浦市", "つくば市", "ひたちなか市"],
      },
      {
        name: "栃木県",
        cities: ["宇都宮市", "足利市", "栃木市", "佐野市", "小山市"],
      },
      {
        name: "群馬県",
        cities: ["前橋市", "高崎市", "桐生市", "伊勢崎市", "太田市"],
      },
      {
        name: "埼玉県",
        cities: ["さいたま市", "川越市", "川口市", "所沢市", "越谷市"],
      },
      {
        name: "千葉県",
        cities: ["千葉市", "船橋市", "松戸市", "柏市", "市川市"],
      },
      {
        name: "東京都",
        cities: [
          "千代田区",
          "中央区",
          "港区",
          "新宿区",
          "文京区",
          "台東区",
          "墨田区",
          "江東区",
          "品川区",
          "目黒区",
          "大田区",
          "世田谷区",
          "渋谷区",
          "中野区",
          "杉並区",
          "豊島区",
          "北区",
          "荒川区",
          "板橋区",
          "練馬区",
          "足立区",
          "葛飾区",
          "江戸川区",
        ],
      },
      {
        name: "神奈川県",
        cities: [
          "横浜市",
          "川崎市",
          "相模原市",
          "横須賀市",
          "藤沢市",
          "鎌倉市",
          "平塚市",
          "厚木市",
          "小田原市",
        ],
      },
    ],
  },

  {
    name: "中部",
    prefectures: [
      { name: "新潟県", cities: ["新潟市", "長岡市", "上越市"] },
      { name: "富山県", cities: ["富山市", "高岡市"] },
      { name: "石川県", cities: ["金沢市", "小松市"] },
      { name: "福井県", cities: ["福井市", "敦賀市"] },
      { name: "山梨県", cities: ["甲府市", "富士吉田市"] },
      { name: "長野県", cities: ["長野市", "松本市", "上田市"] },
      { name: "岐阜県", cities: ["岐阜市", "大垣市", "各務原市"] },
      { name: "静岡県", cities: ["静岡市", "浜松市", "沼津市", "富士市"] },
      {
        name: "愛知県",
        cities: ["名古屋市", "豊田市", "岡崎市", "一宮市", "豊橋市"],
      },
    ],
  },

  {
    name: "近畿",
    prefectures: [
      {
        name: "三重県",
        cities: ["津市", "四日市市", "鈴鹿市", "伊勢市"],
      },
      {
        name: "滋賀県",
        cities: ["大津市", "草津市", "彦根市", "長浜市"],
      },
      {
        name: "京都府",
        cities: ["京都市", "宇治市", "亀岡市", "舞鶴市"],
      },
      {
        name: "大阪府",
        cities: [
          "大阪市",
          "堺市",
          "豊中市",
          "吹田市",
          "高槻市",
          "枚方市",
          "東大阪市",
          "八尾市",
        ],
      },
      {
        name: "兵庫県",
        cities: [
          "神戸市",
          "姫路市",
          "尼崎市",
          "西宮市",
          "明石市",
          "伊丹市",
          "宝塚市",
          "加古川市",
          "芦屋市",
        ],
      },
      {
        name: "奈良県",
        cities: ["奈良市", "橿原市", "生駒市"],
      },
      {
        name: "和歌山県",
        cities: ["和歌山市", "田辺市", "橋本市"],
      },
    ],
  },

  // 中国地方
  {
    name: "中国",
    prefectures: [
      { name: "鳥取県", cities: ["鳥取市", "米子市"] },
      { name: "島根県", cities: ["松江市", "出雲市"] },
      { name: "岡山県", cities: ["岡山市", "倉敷市", "津山市"] },
      { name: "広島県", cities: ["広島市", "福山市", "呉市", "東広島市"] },
      { name: "山口県", cities: ["山口市", "下関市", "宇部市"] },
    ],
  },

  // 四国地方
  {
    name: "四国",
    prefectures: [
      { name: "徳島県", cities: ["徳島市", "阿南市"] },
      { name: "香川県", cities: ["高松市", "丸亀市"] },
      { name: "愛媛県", cities: ["松山市", "今治市", "新居浜市"] },
      { name: "高知県", cities: ["高知市", "南国市"] },
    ],
  },

  // 九州・沖縄地方
  {
    name: "九州・沖縄",
    prefectures: [
      { name: "福岡県", cities: ["福岡市", "北九州市", "久留米市"] },
      { name: "佐賀県", cities: ["佐賀市", "唐津市"] },
      { name: "長崎県", cities: ["長崎市", "佐世保市"] },
      { name: "熊本県", cities: ["熊本市", "八代市"] },
      { name: "大分県", cities: ["大分市", "別府市"] },
      { name: "宮崎県", cities: ["宮崎市", "都城市"] },
      { name: "鹿児島県", cities: ["鹿児島市", "霧島市"] },
      { name: "沖縄県", cities: ["那覇市", "沖縄市", "浦添市"] },
    ],
  },
];
